In [1]:
import pandas as pd

In [2]:
# Read the data in
raw = pd.read_csv('raw.csv', header= None)

In [3]:
# Inspect
raw[:10]

,0,1,2,3,4
0,2011: Median U.S. Annual Salary by Race and Sex,NaN,NaN,NaN,NaN
1,Race,Sex,TOTAL,Percentage women to men,NaN
2,Men,Women,NaN,NaN,NaN
3,Asian,"$50,440","$39,052","$45,032",77.40%
4,White,"$44,512","$36,556","$40,300",82.10%
5,African American,"$33,956","$30,940","$31,890",91.10%
6,Hispanic/Latino,"$29,692","$26,936","$28,548",90.70%
7,NaN,"$43,264","$35,568","$39,312",82.20%
8,2010: Median U.S. Annual Salary by Race and Sex,NaN,NaN,NaN,NaN
9,Race,Sex,TOTAL,Percentage women to men,NaN

From the first 10 rows, we can see that we only need those without 'NaN' data
![](DataWranglingSnapShots/1.PNG)

Row 3 to Row 6 are the the four races' income in 2011.

So all we need is to extract these four lines for every year.


We can drop all NaN rows now, but if we drop them all, the 'Year' information will be lost, i.e, we wouldn't be able to know these four lines are which year's number.

So before we can remove all 'NaN', let's add 'Year' for each group.

In [4]:
# Add the 'Year' Column and Assign an arbitrary number '0' to it 
raw['Year'] = 0

In [5]:
# Inspect
raw[:9]

,0,1,2,3,4,Year
0,2011: Median U.S. Annual Salary by Race and Sex,NaN,NaN,NaN,NaN,0
1,Race,Sex,TOTAL,Percentage women to men,NaN,0
2,Men,Women,NaN,NaN,NaN,0
3,Asian,"$50,440","$39,052","$45,032",77.40%,0
4,White,"$44,512","$36,556","$40,300",82.10%,0
5,African American,"$33,956","$30,940","$31,890",91.10%,0
6,Hispanic/Latino,"$29,692","$26,936","$28,548",90.70%,0
7,NaN,"$43,264","$35,568","$39,312",82.20%,0
8,2010: Median U.S. Annual Salary by Race and Sex,NaN,NaN,NaN,NaN,0

To add the correct 'Year' for each group, we noticed that two rows after every Year-included-row such as '2011: Median U.S. Annual Salary by Race and Sex', it will be the start of four group 'Asian' .   
So we use this pattern to add 'Year' inforamtion for each group.

In [6]:
# Use a function to assign year information
def assignYear(raw):
    # row[0] is the leftmost column, its value is a list like below
    # [2011: Median U.S. Annual Salary by Race and Sex,Race,Men,Asian,White,African American,Hispanic/Latino,...]
    for i in range(len(raw[0])): 
        # This following line detect '2011: Median U.S. Annual Salary by Race and Sex'
        if type(raw[0][i]) != float and raw[0][i].startswith('2'):
            for j in range(1,8):
                # This line takes the year of the previous line and assgn it to its race group
                raw.loc[i+j,'Year'] = raw[0][i][:4]

In [7]:
# Call the function
assignYear(raw)

In [8]:
# Inspect 
raw[:9]

,0,1,2,3,4,Year
0,2011: Median U.S. Annual Salary by Race and Sex,NaN,NaN,NaN,NaN,0
1,Race,Sex,TOTAL,Percentage women to men,NaN,2011
2,Men,Women,NaN,NaN,NaN,2011
3,Asian,"$50,440","$39,052","$45,032",77.40%,2011
4,White,"$44,512","$36,556","$40,300",82.10%,2011
5,African American,"$33,956","$30,940","$31,890",91.10%,2011
6,Hispanic/Latino,"$29,692","$26,936","$28,548",90.70%,2011
7,NaN,"$43,264","$35,568","$39,312",82.20%,2011
8,2010: Median U.S. Annual Salary by Race and Sex,NaN,NaN,NaN,NaN,0

In [9]:
# Drop all NaN data since we have the year information now
raw.dropna(how ='any',inplace=True)

In [10]:
# Inspect
raw[:9]

                   0         1         2         3       4  Year
3              Asian  $50,440   $39,052   $45,032   77.40%  2011
4              White  $44,512   $36,556   $40,300   82.10%  2011
5   African American  $33,956   $30,940   $31,890   91.10%  2011
6    Hispanic/Latino  $29,692   $26,936   $28,548   90.70%  2011
11             Asian  $48,672   $40,196   $44,460   82.60%  2010
12             White  $44,200   $35,568   $39,870   80.50%  2010
13  African American  $32,916   $30,784   $31,772   93.50%  2010
14   Hispanic/Latino  $29,129   $26,416   $27,820   90.70%  2010
19             Asian  $49,504   $40,508   $45,760   81.80%  2009

What the original table looks like:
![](DataWranglingSnapShots/2.PNG)

The first number column is for men, the second column is for women, and the third one is for all.
All we need is the third column. So, drop first and second number columns.

In [11]:
# Drop male, female and women to men percentage columns
df = raw.drop([1,2,4],axis = 1).rename(columns = {0:'Race', 3:'Median U.S. Annual Salary per Year'}).reset_index().drop(['index'],axis = 1)

In [12]:
# Inspect
df[:5]

               Race Median U.S. Annual Salary per Year  Year
0             Asian                           $45,032   2011
1             White                           $40,300   2011
2  African American                           $31,890   2011
3   Hispanic/Latino                           $28,548   2011
4             Asian                           $44,460   2010

In [13]:
# Convert currence type in 'Total' to integer type
df['Median U.S. Annual Salary per Year']  = df['Median U.S. Annual Salary per Year'].replace('[\$,]', '', regex=True).astype(int)

In [14]:
# Insert a Row for every year to store all minority groups' average Median U.S. Annual Salary  per Year
for i in range(4,len(df),5):
    line = pd.DataFrame({'Race':'All Minority'}, index = [i])
    df = pd.concat([df.iloc[:i], line, df.iloc[i:]]).reset_index(drop=True)

In [15]:
# Inspect
df[:5]

   Median U.S. Annual Salary per Year              Race  Year
0                             45032.0             Asian  2011
1                             40300.0             White  2011
2                             31890.0  African American  2011
3                             28548.0   Hispanic/Latino  2011
4                                 NaN      All Minority   NaN

In [16]:
# Compute the average and then store the average and year for all 'All Minority' rows
for i in range(4,len(df),5):
    if df.loc[i,'Race'] == 'All Minority':
        df.loc[i,'Median U.S. Annual Salary per Year'] = int((df.loc[i-4,'Median U.S. Annual Salary per Year'] + df.loc[i-2,'Median U.S. Annual Salary per Year'] + df.loc[i-1,'Median U.S. Annual Salary per Year']) / 3)
        df.loc[i,'Year'] = df.loc[i-4,'Year']

In [17]:
# Inspect
df[:5]

   Median U.S. Annual Salary per Year              Race  Year
0                             45032.0             Asian  2011
1                             40300.0             White  2011
2                             31890.0  African American  2011
3                             28548.0   Hispanic/Latino  2011
4                             35156.0      All Minority  2011

Rearrange the columns

In [18]:
columns = list(df)

In [19]:
columns

['Median U.S. Annual Salary per Year', 'Race', 'Year']

In [20]:
columns[0],columns[2] = columns[2],columns[0]

In [21]:
df = df.loc[:,columns]

In [22]:
# Inspect
df[:5]

   Year              Race  Median U.S. Annual Salary per Year
0  2011             Asian                             45032.0
1  2011             White                             40300.0
2  2011  African American                             31890.0
3  2011   Hispanic/Latino                             28548.0
4  2011      All Minority                             35156.0

In [23]:
# Save it to csv
df.to_csv('data.csv')